{
  "hierarchical_manager_agent": {
    "role": "Руководитель команды",
    "goal": "Управлять командой для достижения наилучшего результата задачи.",
    "backstory": "Вы опытный руководитель с талантом вытягивать лучшее из своей команды.\nВас также отличает способность делегировать работу нужным людям и задавать правильные вопросы, чтобы получить максимум от своей команды.\nХотя вы сами не выполняете задачи, у вас есть большой опыт в этой области, что позволяет вам правильно оценивать работу членов вашей команды."
  },
  "slices": {
    "observation": "\nНаблюдение",
    "task": "Начинайте! Это ОЧЕНЬ важно для вас, ваша работа от этого зависит!\n\nТекущая задача: {input}",
    "memory": "Это краткое описание вашей работы до сих пор:\n{chat_history}",
    "role_playing": "Вы {role}.\n{backstory}\n\nВаш личный цель: {goal}",
    "tools": "TOOLS:\n------\nУ вас есть доступ только к следующим инструментам:\n\n{tools}\n\nЧтобы использовать инструмент, пожалуйста, используйте следующий формат:\n\n```\nThought: Нужно ли мне использовать инструмент? Да\nAction: действие, которое нужно выполнить, должно быть одним из [{tool_names}], просто название.\nAction Input: входные данные для действия\nObservation: результат действия\n```\n\nКогда у вас есть ответ на вашу задачу или если вам не нужно использовать инструмент, ВЫ ОБЯЗАНЫ использовать формат:\n\n```\nThought: Нужно ли мне использовать инструмент? Нет\nFinal Answer: [ваш ответ здесь]```",
    "task_with_context": "{task}\nВот контекст, с которым вы работаете:\n{context}",
    "expected_output": "Ваш окончательный ответ должен быть: {expected_output}"
  },
  "errors": {
    "force_final_answer": "На самом деле, я использовал слишком много инструментов, поэтому я остановлюсь сейчас и дам вам мой АБСОЛЮТНО ЛУЧШИЙ окончательный ответ, используя ожидаемый формат: ```\nThought: Нужно ли мне использовать инструмент? Нет\nFinal Answer: [ваш ответ здесь]```",
    "agent_tool_missing_param": "\nОшибка выполнения инструмента. Отсутствуют точно 3 значения, разделенные вертикальной чертой (|). Например, `сотрудник|задача|контекст`. Я должен убедиться, что передаю контекст как контекст.\n",
    "agent_tool_unexsiting_coworker": "\nОшибка выполнения инструмента. Указанный сотрудник в действии не найден, он должен быть одним из следующих вариантов: {coworkers}.\n",
    "task_repeated_usage": "Я только что использовал инструмент {tool} с входными данными {tool_input}. Так что я уже знаю результат этого и не нужно использовать его сейчас.\n"
  },
  "tools": {
    "delegate_work": "Полезно делегировать конкретную задачу одному из следующих сотрудников: {coworkers}.\nВходные данные для этого инструмента должны быть текстом, разделенным вертикальной чертой (|) длиной 3 (три), представляющим сотрудника, которому вы хотите задать вопрос (один из вариантов), задачу и все фактический контекст, который у вас есть для задачи.\nНапример, `сотрудник|задача|контекст`.",
    "ask_question": "Полезно задать вопрос, высказать мнение или получить от одного из следующих сотрудников: {coworkers}.\nВходные данные для этого инструмента должны быть текстом, разделенным вертикальной чертой (|) длиной 3 (три), представляющим сотрудника, которому вы хотите задать вопрос (один из вариантов), вопрос и все фактический контекст, который у вас есть для вопроса.\nНапример, `сотрудник|вопрос|контекст`."
  }
}